[{"idMeal":"52795","strMeal":"Chicken Handi","strCategory":"Chicken","strArea":"Indian","strInstructions":"Take a large pot or wok, big enough to cook all the chicken, and heat the oil in it. Once the oil is hot, add sliced onion and fry them until deep golden brown. Then take them out on a plate and set aside.\r\nTo the same pot, add the chopped garlic and sauté for a minute. Then add the chopped tomatoes and cook until tomatoes turn soft. This would take about 5 minutes.\r\nThen return the fried onion to the pot and stir. Add ginger paste and sauté well.\r\nNow add the cumin seeds, half of the coriander seeds and chopped green chillies. Give them a quick stir.\r\nNext goes in the spices – turmeric powder and red chilli powder. Sauté the spices well for couple of minutes.\r\nAdd the chicken pieces to the wok, season it with salt to taste and cook the chicken covered on medium-low heat until the chicken is almost cooked through. This would take about 15 minutes. Slowly sautéing the chicken will enhance the flavor, so do not expedite this step by putting it on high heat.\r\nWhen the oil separates from the spices, add the beaten yogurt keeping the heat on lowest so that the yogurt doesn’t split. Sprinkle the remaining coriander seeds and add half of the dried fenugreek leaves. Mix well.\r\nFinally add the cream and give a final mix to combine everything well.\r\nSprinkle the remaining kasuri methi and garam masala and serve the chicken handi hot with naan or rotis. Enjoy!","strMealThumb":"https://www.themealdb.com/images/media/meals/wyxwsp1486979827.jpg","strYoutube":"https://www.youtube.com/watch?v=IO0issT0Rmc","strIngredient1":"Chicken","strIngredient2":"Onion","strIngredient3":"Tomatoes","strIngredient4":"Garlic","strIngredient5":"Ginger paste","strIngredient6":"Vegetable oil","strIngredient7":"Cumin seeds","strIngredient8":"Coriander seeds","strIngredient9":"Turmeric powder","strIngredient10":"Chilli powder","strIngredient11":"Green chilli","strIngredient12":"Yogurt","strIngredient13":"Cream","strIngredient14":"fenugreek","strIngredient15":"Garam masala","strIngredient16":"Salt","strIngredient17":"","strIngredient18":"","strIngredient19":"","strIngredient20":"","strMeasure1":"1.2 kg","strMeasure2":"5 thinly sliced","strMeasure3":"2 finely chopped","strMeasure4":"8 cloves chopped","strMeasure5":"1 tbsp","strMeasure6":"¼ cup","strMeasure7":"2 tsp","strMeasure8":"3 tsp","strMeasure9":"1 tsp","strMeasure10":"1 tsp","strMeasure11":"2","strMeasure12":"1 cup","strMeasure13":"¾ cup","strMeasure14":"3 tsp Dried","strMeasure15":"1 tsp","strMeasure16":"To taste","strMeasure17":"","strMeasure18":"","strMeasure19":"","strMeasure20":"","strSource":""},{"idMeal":"52807","strMeal":"Baingan Bharta","strCategory":"Vegetarian","strArea":"Indian","strInstructions":"Rinse the baingan (eggplant or aubergine) in water. Pat dry with a kitchen napkin. Apply some oil all over and\r\nkeep it for roasting on an open flame. You can also grill the baingan or roast in the oven. But then you won't get\r\nthe smoky flavor of the baingan. Keep the eggplant turning after a 2 to 3 minutes on the flame, so that its evenly\r\ncooked. You could also embed some garlic cloves in the baingan and then roast it.\r\n2. Roast the aubergine till its completely cooked and tender. With a knife check the doneness. The knife should slid\r\neasily in aubergines without any resistance. Remove the baingan and immerse in a bowl of water till it cools\r\ndown.\r\n3. You can also do the dhungar technique of infusing charcoal smoky flavor in the baingan. This is an optional step.\r\nUse natural charcoal for this method. Heat a small piece of charcoal on flame till it becomes smoking hot and red.\r\n4. Make small cuts on the baingan with a knife. Place the red hot charcoal in the same plate where the roasted\r\naubergine is kept. Add a few drops of oil on the charcoal. The charcoal would begin to smoke.\r\n5. As soon as smoke begins to release from the charcoal, cover the entire plate tightly with a large bowl. Allow the\r\ncharcoal smoke to get infused for 1 to 2 minutes. The more you do, the more smoky the baingan bharta will\r\nbecome. I just keep for a minute. Alternatively, you can also do this dhungar method once the baingan bharta is\r\ncooked, just like the way we do for Dal Tadka.\r\n6. Peel the skin from the roasted and smoked eggplant.\r\n7. Chop the cooked eggplant finely or you can even mash it.\r\n8. In a kadai or pan, heat oil. Then add finely chopped onions and garlic.\r\n9. Saute the onions till translucent. Don't brown them.\r\n10. Add chopped green chilies and saute for a minute.\r\n11. Add the chopped tomatoes and mix it well.\r\n12. Bhuno (saute) the tomatoes till the oil starts separating from the mixture.\r\n13. Now add the red chili powder. Stir and mix well.\r\n14. Add the chopped cooked baingan.\r\n15. Stir and mix the chopped baingan very well with the onion­tomato masala mixture.\r\n16. Season with salt. Stir and saute for some more 4 to 5 minutes more.\r\n17. Finally stir in the coriander leaves with the baingan bharta or garnish it with them. Serve Baingan Bharta with\r\nphulkas, rotis or chapatis. It goes well even with bread, toasted or grilled bread and plain rice or jeera rice.","strMealThumb":"https://www.themealdb.com/images/media/meals/urtpqw1487341253.jpg","strYoutube":"https://www.youtube.com/watch?v=-84Zz2EP4h4","strIngredient1":"Aubergine","strIngredient2":"Onion","strIngredient3":"Tomatoes","strIngredient4":"Garlic","strIngredient5":"Green Chili","strIngredient6":"Red Chili Powder","strIngredient7":"Oil","strIngredient8":"Coriander Leaves","strIngredient9":"salt","strIngredient10":"","strIngredient11":"","strIngredient12":"","strIngredient13":"","strIngredient14":"","strIngredient15":"","strIngredient16":"","strIngredient17":"","strIngredient18":"","strIngredient19":"","strIngredient20":"","strMeasure1":"1 large","strMeasure2":"½ cup ","strMeasure3":"1 cup","strMeasure4":"6 cloves","strMeasure5":"1","strMeasure6":"¼ teaspoon","strMeasure7":"1.5 tablespoon","strMeasure8":"1 tablespoon chopped","strMeasure9":"as required","strMeasure10":"","strMeasure11":"","strMeasure12":"","strMeasure13":"","strMeasure14":"","strMeasure15":"","strMeasure16":"","strMeasure17":"","strMeasure18":"","strMeasure19":"","strMeasure20":"","strSource":"http://www.vegrecipesofindia.com/baingan-bharta-recipe-punjabi-baingan-bharta-recipe/"},{"idMeal":"52849","strMeal":"Spinach & Ricotta Ca...","strCategory":"Vegetarian","strArea":"Italian","strInstructions":"First make the tomato sauce. Heat the oil in a large pan and fry the garlic for 1 min. Add the sugar, vinegar, tomatoes and some seasoning and simmer for 20 mins, stirring occasionally, until thick. Add the basil and divide the sauce between 2 or more shallow ovenproof dishes (see Tips for freezing, below). Set aside. Make a sauce by beating the mascarpone with the milk until smooth, season, then set aside.\r\n\r\nPut the spinach in a large colander and pour over a kettle of boiling water to wilt it (you may need to do this in batches). When cool enough to handle squeeze out the excess water. Roughly chop the spinach and mix in a large bowl with 100g Parmesan and ricotta. Season well with salt, pepper and the nutmeg.\r\n\r\nHeat oven to 200C/180C fan/gas 6. Using a piping bag or plastic food bag with the corner snipped off, squeeze the filling into the cannelloni tubes. Lay the tubes, side by side, on top of the tomato sauce and spoon over the mascarpone sauce. Top with Parmesan and mozzarella. You can now freeze the cannelloni, uncooked, or you can cook it first and then freeze. Bake for 30-35 mins until golden and bubbling. Remove from oven and let stand for 5 mins before serving.","strMealThumb":"https://www.themealdb.com/images/media/meals/wspuvp1511303478.jpg","strYoutube":"https://www.youtube.com/watch?v=rYGaEJjyLQA","strIngredient1":"Olive Oil","strIngredient2":"Garlic","strIngredient3":"Caster Sugar","strIngredient4":"Red Wine Vinegar","strIngredient5":"Chopped Tomatoes","strIngredient6":"Basil Leaves","strIngredient7":"Mascarpone","strIngredient8":"Milk","strIngredient9":"Parmesan","strIngredient10":"Mozzarella","strIngredient11":"Spinach","strIngredient12":"Parmesan","strIngredient13":"Ricotta","strIngredient14":"Nutmeg","strIngredient15":"Cannellini Beans","strIngredient16":"","strIngredient17":"","strIngredient18":"","strIngredient19":"","strIngredient20":"","strMeasure1":"3 tbsp","strMeasure2":"8 cloves chopped","strMeasure3":"3 tbsp","strMeasure4":"2 tblsp ","strMeasure5":"3 400g Cans","strMeasure6":"Bunch","strMeasure7":"2 tubs","strMeasure8":"3 tbsp","strMeasure9":"85g","strMeasure10":"2 sliced","strMeasure11":"1kg","strMeasure12":"100g ","strMeasure13":"3 tubs","strMeasure14":"pinch","strMeasure15":"400g","strMeasure16":"","strMeasure17":"","strMeasure18":"","strMeasure19":"","strMeasure20":"","strSource":"https://www.bbcgoodfood.com/recipes/531632/spinach-and-ricotta-cannelloni"},{"idMeal":"52910","strMeal":"Chinon Apple Tarts","strCategory":"Dessert","strArea":"French","strInstructions":"To make the red wine jelly, put the red wine, jam sugar, star anise, clove, cinnamon stick, allspice, split vanilla pod and seeds in a medium saucepan. Stir together, then heat gently to dissolve the sugar. Turn up the heat and boil for 20 mins until reduced and syrupy. Strain into a small, sterilised jam jar and leave to cool completely. Will keep in the fridge for up to 1 month.\r\n\r\nTake the pastry out of the fridge and leave at room temperature for 10 mins, then unroll. Heat the grill to high and heat the oven to 180C/160C fan/gas 4. Cut out 2 x 13cm circles of pastry, using a plate as a guide, and place on a non-stick baking sheet. Sprinkle each circle with 1 tbsp sugar and grill for 5 mins to caramelise, watching carefully so that the sugar doesn’t burn. Remove from the grill. Can be done a few hours ahead, and left, covered, out of the fridge.\r\n\r\nPeel, quarter and core the apples, cut into 2mm-thin slices and arrange on top of the pastry. Sprinkle over the remaining sugar and pop in the oven for 20-25 mins until the pastry is cooked through and golden, and the apples are softened. Remove and allow to cool slightly. Warm 3 tbsp of the red wine jelly in a small pan over a low heat with 1 tsp water to make it a little more runny, then brush over the top of the tarts.\r\n\r\nTip the crème fraîche into a bowl, sift over the icing sugar and cardamom, and mix together. Carefully lift the warm tarts onto serving plates and serve with the cardamom crème fraîche.","strMealThumb":"https://www.themealdb.com/images/media/meals/qtqwwu1511792650.jpg","strYoutube":"https://www.youtube.com/watch?v=5dAW9HQgtCk","strIngredient1":"Puff Pastry","strIngredient2":"Dark Brown Soft Sugar","strIngredient3":"Braeburn Apples","strIngredient4":"Red Wine Jelly","strIngredient5":"Creme Fraiche","strIngredient6":"Icing Sugar","strIngredient7":"Cardamom","strIngredient8":"","strIngredient9":"","strIngredient10":"","strIngredient11":"","strIngredient12":"","strIngredient13":"","strIngredient14":"","strIngredient15":"","strIngredient16":"","strIngredient17":"","strIngredient18":"","strIngredient19":"","strIngredient20":"","strMeasure1":"320g","strMeasure2":"4 tbs","strMeasure3":"3","strMeasure4":"4 tbs","strMeasure5":"100ml","strMeasure6":"1 tbs","strMeasure7":"3","strMeasure8":"","strMeasure9":"","strMeasure10":"","strMeasure11":"","strMeasure12":"","strMeasure13":"","strMeasure14":"","strMeasure15":"","strMeasure16":"","strMeasure17":"","strMeasure18":"","strMeasure19":"","strMeasure20":"","strSource":"https://www.bbcgoodfood.com/recipes/chinon-apple-tarts"},{"idMeal":"52805","strMeal":"Lamb Biryani","strCategory":"Lamb","strArea":"Indian","strInstructions":"Grind the cashew, poppy seeds and cumin seeds into a smooth paste, using as little water as possible. Set aside. \r\n\r\nDeep fry the sliced onions when it is hot. Don’t overcrowd the oil. When the onions turn light brown, remove from oil and drain on paper towel. The fried onion will crisp up as it drains. Also fry the cashewnuts till golden brown. Set aside.\r\n\r\nWash the rice and soak in water for twenty minutes.\r\nMeanwhile, take a big wide pan, add oil in medium heat, add the sliced onions, add the blended paste, to it add the green chillies, ginger garlic paste and garlic and fry for a minute.\r\nThen add the tomatoes and sauté them well till they are cooked and not mushy.\r\n\r\nThen to it add the red chilli powder, biryani powder, mint, coriander leaves and sauté them well.\r\nAdd the yogurt and mix well. I always move the skillet away from the heat when adding yogurt which prevents it from curdling.\r\n\r\nNow after returning the skillet back to the stove, add the washed lamb and salt and ½ cup water and mix well. Cook for 1 hour and cook it covered in medium low heat or put it in a pressure cooker for 6 whistles. If the water is not drained totally, heat it by keeping it open.\r\n\r\nTake another big pan, add thrice the cup of rice you use, and boil it. When it is boiling high, add the rice, salt and jeera and mix well. After 7 minutes exact or when the rice is 80% done. Switch off and drain the rice.\r\n\r\nNow, the layering starts. To the lamb, pat and level it. Add the drained hot rice on the top of it. Garnish with fried onions, ghee, mint, coriander leaves and saffron dissolved in milk.\r\n\r\nCover the dish and bake in a 350f oven for 15 minutes or till the cooked but not mushy. Or cook in the stove medium heat for 12 minutes and lowest heat for 5 minutes. And switch off. Mix and serve hot!\r\nNotes\r\n1. If you are cooking in oven, do make sure to cook in a big oven safe pan and cover it tight and then keep in oven for the final step.\r\n2. You can skip biryani masala if you don’t have and add just garam masala (1 tsp and red chilli powder – 3 tsp instead of 1 tsp)\r\n3. If it is spicy in the end, squeeze some lemon, it will reduce the heat and enhance the flavors also.","strMealThumb":"https://www.themealdb.com/images/media/meals/xrttsx1487339558.jpg","strYoutube":"https://www.youtube.com/watch?v=r7SYVSG5nxo","strIngredient1":"Cashew nuts","strIngredient2":"Khus khus","strIngredient3":"Cumin seeds","strIngredient4":"Onions","strIngredient5":"Ginger garlic paste","strIngredient6":"Garlic","strIngredient7":"Mint","strIngredient8":"Cilantro","strIngredient9":"Saffron","strIngredient10":"Ghee","strIngredient11":"Basmati rice","strIngredient12":"Full fat yogurt","strIngredient13":"Cumin Seeds","strIngredient14":"Bay leaf","strIngredient15":"Cinnamon","strIngredient16":"Cloves","strIngredient17":"Cardamom","strIngredient18":"Lamb","strIngredient19":"Red Chilli powder","strIngredient20":"Biryani masala","strMeasure1":"12","strMeasure2":"½ tbsp","strMeasure3":"½ tbsp","strMeasure4":"3 sliced thinly","strMeasure5":"2 tsp","strMeasure6":"4 whole","strMeasure7":"Leaves","strMeasure8":"Leaves","strMeasure9":"½ tsp dissolved in ½ cup warm milk","strMeasure10":"2 tbsp","strMeasure11":"2 Cups","strMeasure12":"½ cup","strMeasure13":"1 tbsp","strMeasure14":"½","strMeasure15":"1 thin piece","strMeasure16":"3","strMeasure17":"2","strMeasure18":"1 lb","strMeasure19":"1 tsp","strMeasure20":"1 tbsp","strSource":"http://www.relishthebite.com/restaurant-style-lamb-biryani/"},{"idMeal":"52990","strMeal":"Christmas cake","strCategory":"Dessert","strArea":"British","strInstructions":"Heat oven to 160C/fan 140C/gas 3. Line the base and sides of a 20 cm round, 7.5 cm deep cake tin. Beat the butter and sugar with an electric hand mixer for 1-2 mins until very creamy and pale in colour, scraping down the sides of the bowl half way through. Stir in a spoonful of the flour, then stir in the beaten egg and the rest of the flour alternately, a quarter at a time, beating well each time with a wooden spoon. Stir in the almonds.\r\n\r\nMix in the sherry (the mix will look curdled), then add the peel, cherries, raisins, cherries, nuts, lemon zest, spice, rosewater and vanilla. Beat together to mix, then stir in the baking powder.\r\n\r\nSpoon mixture into the tin and smooth the top, making a slight dip in the centre. Bake for 30 mins, then lower temperature to 150C/fan 130C/gas 2 and bake a further 2-2¼ hrs, until a skewer insterted in the middle comes out clean. Leave to cool in the tin, then take out of the tin and peel off the lining paper. When completely cold, wrap well in cling film and foil to store until ready to decorate. The cake will keep for several months.","strMealThumb":"https://www.themealdb.com/images/media/meals/ldnrm91576791881.jpg","strYoutube":"https://www.youtube.com/watch?v=34yeL8TstO0","strIngredient1":"Butter","strIngredient2":"Muscovado Sugar","strIngredient3":"Plain Flour","strIngredient4":"Eggs","strIngredient5":"Ground Almonds","strIngredient6":"Sherry","strIngredient7":"Candied Peel","strIngredient8":"Glace Cherry","strIngredient9":"Raisins","strIngredient10":"Currants","strIngredient11":"Pecan Nuts","strIngredient12":"Lemon","strIngredient13":"Mixed Spice","strIngredient14":"Rose water","strIngredient15":"Vanilla Extract","strIngredient16":"Baking Powder","strIngredient17":"","strIngredient18":"","strIngredient19":"","strIngredient20":"","strMeasure1":"200g","strMeasure2":"200g","strMeasure3":"200g","strMeasure4":"4 Beaten","strMeasure5":"50g","strMeasure6":"100ml","strMeasure7":"85g","strMeasure8":"85g","strMeasure9":"250g","strMeasure10":"250g","strMeasure11":"100g ","strMeasure12":"Grated zest of 1","strMeasure13":"1 ½ tbsp","strMeasure14":"1 ½ tbsp","strMeasure15":"1/2 tsp","strMeasure16":"1/2 tsp","strMeasure17":" ","strMeasure18":" ","strMeasure19":" ","strMeasure20":" ","strSource":"https://www.bbcgoodfood.com/recipes/angela-nilsens-christmas-cake"}]